ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_hps.c
/***************************************************************************//**
* \file cy_ble_hps.c
* \version 2.0
*
* \brief
*  Contains the source code for HTTP Proxy Service.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_ble_event_handler.h"

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

#if (CY_BLE_MODE_PROFILE && defined(CY_BLE_HPS))

#ifdef CY_BLE_HPS_SERVER
/* The internal storage for the last request handle to check response for server */
static cy_ble_gatt_db_attr_handle_t cy_ble_hpssReqHandle;
#endif /* CY_BLE_HPS_SERVER */

#ifdef CY_BLE_HPS_CLIENT
/* HPS Center Service characteristics GATT DB handles structure */
cy_stc_ble_hpsc_t cy_ble_hpsc[CY_BLE_CONFIG_GATTC_COUNT];

/* The internal storage for the last request handle to check response */
static cy_ble_gatt_db_attr_handle_t cy_ble_hpscReqHandle[CY_BLE_CONFIG_GATTC_COUNT];

/* Variables for Read Long Characteristic Values handling */
static uint8_t * cy_ble_hpscRdLongBuffPtr;
static uint16_t cy_ble_hpscRdLongBuffLen;
static uint16_t cy_ble_hpscCurrLen;
#endif /* CY_BLE_HPS_CLIENT */

static cy_ble_callback_t Cy_BLE_HPS_ApplCallback = NULL;

/* The pointer on global BLE HPS Config structure */
cy_stc_ble_hps_config_t *cy_ble_hpsConfigPtr = NULL;

/***************************************
* Private Function Prototypes
***************************************/
#ifdef CY_BLE_HPS_SERVER
static cy_en_ble_gatt_err_code_t Cy_BLE_HPSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam);
static void Cy_BLE_HPSS_PrepareWriteRequestEventHandler(const cy_stc_ble_gatts_prep_write_req_param_t *eventParam);
static void Cy_BLE_HPSS_ExecuteWriteRequestEventHandler(cy_stc_ble_gatts_exec_write_req_t *eventParam);
#endif /* CY_BLE_HPS_SERVER */

#ifdef CY_BLE_HPS_CLIENT
static void Cy_BLE_HPSC_DiscoverCharacteristicsEventHandler(cy_stc_ble_disc_char_info_t *discCharInfo);
static void Cy_BLE_HPSC_DiscoverCharDescriptorsEventHandler(cy_stc_ble_disc_descr_info_t *discDescrInfo);
static void Cy_BLE_HPSC_GetCharRange(cy_stc_ble_disc_range_info_t *charRangeInfo);
static void Cy_BLE_HPSC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam);
static void Cy_BLE_HPSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam);
static void Cy_BLE_HPSC_ReadLongRespEventHandler(const cy_stc_ble_gattc_read_rsp_param_t *eventParam);
static void Cy_BLE_HPSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam);
static void Cy_BLE_HPSC_ExecuteWriteResponseEventHandler(const cy_stc_ble_gattc_exec_write_rsp_t *eventParam);
static void Cy_BLE_HPSC_ErrorResponseEventHandler(const cy_stc_ble_gatt_err_param_t *eventParam);
#endif /* CY_BLE_HPS_CLIENT */
static cy_en_ble_gatt_err_code_t Cy_BLE_HPS_EventHandler(uint32_t eventCode, void *eventParam);


/******************************************************************************
* Function Name: Cy_BLE_HPS_Init
***************************************************************************//**
*
*  This function initializes HTTP Proxy Service.
*
*  \param config: Configuration structure for the HTTP Proxy Service.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                             | Description
*   ------------                            | -----------
*   CY_BLE_SUCCESS                          | The function completed successfully.
*   CY_BLE_ERROR_INVALID_PARAMETER          | On specifying NULL as input parameter
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED   | Buffer overflow in the registration callback.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_HPS_Init(cy_stc_ble_hps_config_t *config)
{
    cy_en_ble_api_result_t apiResult;

    if(config == NULL)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        /* Registers a pointer to config structure */
        cy_ble_hpsConfigPtr = config;

        /* Registers Event Handler for the HPS Service */
        apiResult = Cy_BLE_RegisterServiceEventHandler(&Cy_BLE_HPS_EventHandler);

        /* Registers a callback function via config structure */
        if(cy_ble_hpsConfigPtr->callbackFunc != NULL)
        {
            Cy_BLE_HPS_ApplCallback = cy_ble_hpsConfigPtr->callbackFunc;
        }

    #ifdef CY_BLE_HPS_SERVER
        cy_ble_hpssReqHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
    #endif /* CY_BLE_HPS_SERVER */

    #ifdef CY_BLE_HPS_CLIENT
        {
            uint32_t idx;
            cy_ble_hpscRdLongBuffPtr = NULL;
            cy_ble_hpscRdLongBuffLen = 0u;
            cy_ble_hpscCurrLen = 0u;

            for(idx = 0u; idx < CY_BLE_CONFIG_GATTC_COUNT; idx++)
            {
                if(cy_ble_serverInfo[idx][CY_BLE_SRVI_HPS].range.startHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
                {
                    (void)memset(&cy_ble_hpsc[idx], 0, sizeof(cy_stc_ble_hpsc_t));

                    /* initialize uuid  */
                    cy_ble_serverInfo[idx][CY_BLE_SRVI_HPS].uuid = CY_BLE_UUID_HTTP_PROXY_SERVICE;
                }
                cy_ble_hpscReqHandle[idx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            }
        }
    #endif /* CY_BLE_HPS_CLIENT */
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_HPS_RegisterAttrCallback
***************************************************************************//**
*
*  Registers a callback function for service-specific attribute operations.
*  Service specific write requests from peer device will not be handled with
*  unregistered callback function.
*
*  \param callbackFunc:  An application layer event callback function to receive
*                 events from the BLE Component. The definition of
*                 cy_ble_callback_t is: \n
*                 typedef void (* cy_ble_callback_t) (uint32_t eventCode,
*                                                    void *eventParam) \n
*                 * eventCode - Indicates the event that triggered this
*                   callback (e.g. CY_BLE_EVT_HPSS_NOTIFICATION_ENABLED).
*                 * eventParam - Contains the parameters corresponding to the
*                   current event. (e.g. pointer to cy_stc_ble_hps_char_value_t
*                   structure that contains details of the characteristic
*                   for which an indication enabled event was triggered).
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes:
*
*   Error Codes                             | Description
*   ------------                            | -----------
*   CY_BLE_SUCCESS                          | The function completed successfully.
*   CY_BLE_ERROR_INVALID_OPERATION          | This operation is not permitted
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_HPS_RegisterAttrCallback(cy_ble_callback_t callbackFunc)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    
    Cy_BLE_HPS_ApplCallback = callbackFunc;
    if(cy_ble_hpsConfigPtr != NULL)
    {
        cy_ble_hpsConfigPtr->callbackFunc = callbackFunc;
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
    
    return(apiResult);
}


#ifdef CY_BLE_HPS_SERVER

