ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_hps.c
/******************************************************************************
* Function Name: Cy_BLE_HPSS_WriteEventHandler
***************************************************************************//**
*
*  Handles Write Request Event for HTTP Proxy Service.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
* \return
*  Return value is of type cy_en_ble_gatt_err_code_t.
*   * CY_BLE_GATT_ERR_NONE - Write is successful.
*   * CY_BLE_GATT_ERR_REQUEST_NOT_SUPPORTED - The request is not supported.
*   * CY_BLE_GATT_ERR_INVALID_HANDLE - 'handleValuePair.attrHandle' is not valid.
*   * CY_BLE_GATT_ERR_WRITE_NOT_PERMITTED - The write operation is not permitted on
*                                          this attribute.
*   * CY_BLE_GATT_ERR_INVALID_OFFSET - The offset value is invalid.
*   * CY_BLE_GATT_ERR_UNLIKELY_ERROR - Some other error occurred.
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_HPSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;
    uint32_t event = (uint32_t)CY_BLE_EVT_HPSS_NOTIFICATION_DISABLED;
    cy_stc_ble_hps_char_value_t wrCharReqParam =
    {
        .connHandle = eventParam->connHandle
    };

    if(Cy_BLE_HPS_ApplCallback != NULL)
    {
        /* Client Characteristic Configuration descriptor write request */
        if(eventParam->handleValPair.attrHandle ==
           cy_ble_hpsConfigPtr->hpss->charInfo[CY_BLE_HPS_HTTP_STATUS_CODE].descrHandle[CY_BLE_HPS_CCCD])
        {
            wrCharReqParam.charIndex = CY_BLE_HPS_HTTP_STATUS_CODE;
            wrCharReqParam.value = NULL;

            if(CY_BLE_IS_NOTIFICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
            {
                event = (uint32_t)CY_BLE_EVT_HPSS_NOTIFICATION_ENABLED;
            }
        }
        else
        {
            event = (uint32_t)CY_BLE_EVT_HPSS_WRITE_CHAR;
            wrCharReqParam.value = &eventParam->handleValPair.value;

            if(cy_ble_hpsConfigPtr->hpss->charInfo[CY_BLE_HPS_URI].charHandle == eventParam->handleValPair.attrHandle)
            {
                wrCharReqParam.charIndex = CY_BLE_HPS_URI;
            }
            else if(cy_ble_hpsConfigPtr->hpss->charInfo[CY_BLE_HPS_HTTP_HEADERS].charHandle ==
                    eventParam->handleValPair.attrHandle)
            {
                wrCharReqParam.charIndex = CY_BLE_HPS_HTTP_HEADERS;
            }
            else if(cy_ble_hpsConfigPtr->hpss->charInfo[CY_BLE_HPS_HTTP_ENTITY_BODY].charHandle ==
                    eventParam->handleValPair.attrHandle)
            {
                wrCharReqParam.charIndex = CY_BLE_HPS_HTTP_ENTITY_BODY;
            }
            else if(cy_ble_hpsConfigPtr->hpss->charInfo[CY_BLE_HPS_HTTP_CP].charHandle ==
                    eventParam->handleValPair.attrHandle)
            {
                if(CY_BLE_IS_NOTIFICATION_ENABLED(eventParam->connHandle.attId,
                                                  cy_ble_hpsConfigPtr->hpss->charInfo[CY_BLE_HPS_HTTP_STATUS_CODE].
                                                   descrHandle[CY_BLE_HPS_CCCD]))
                {
                    wrCharReqParam.charIndex = CY_BLE_HPS_HTTP_CP;
                }
                else
                {
                    gattErr = CY_BLE_GATT_ERR_CCCD_IMPROPERLY_CONFIGURED;

                    /* Clear callback flag indicating that request was handled */
                    cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                }
            }
            else
            {
                /* Set charIndex  to CY_BLE_HPS_CHAR_COUNT as the requested handle doesn't
                 * match to any handles of HPS characteristics.
                 */
                wrCharReqParam.charIndex = CY_BLE_HPS_CHAR_COUNT;
            }
        }

        if(gattErr == CY_BLE_GATT_ERR_NONE)
        {
            if(wrCharReqParam.charIndex < CY_BLE_HPS_CHAR_COUNT)
            {
                cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                {
                    .handleValuePair = eventParam->handleValPair,
                    .connHandle      = eventParam->connHandle,
                    .offset          = 0u,
                    .flags           = CY_BLE_GATT_DB_PEER_INITIATED
                };

                gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);

                if(gattErr == CY_BLE_GATT_ERR_NONE)
                {
                    if((event == (uint32_t)CY_BLE_EVT_HPSS_WRITE_CHAR) &&
                       (wrCharReqParam.value->len <=
                        (CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_MAX_LEN(eventParam->handleValPair.attrHandle))))
                    {
                        CY_BLE_GATT_DB_ATTR_SET_ATTR_GEN_LEN(eventParam->handleValPair.attrHandle,
                                                             wrCharReqParam.value->len);
                    }

                    /* Make sure that GATT error is set to "No error" */
                    wrCharReqParam.gattErrorCode = CY_BLE_GATT_ERR_NONE;
                    Cy_BLE_HPS_ApplCallback(event, &wrCharReqParam);
                    gattErr = wrCharReqParam.gattErrorCode;
                }

                if((event == (uint32_t)CY_BLE_EVT_HPSS_NOTIFICATION_ENABLED) ||
                   (event == (uint32_t)CY_BLE_EVT_HPSS_NOTIFICATION_DISABLED))
                {
                #if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && \
                    (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
                    /* Set flag to store bonding data to flash */
                    if(cy_ble_peerBonding[eventParam->connHandle.attId] == CY_BLE_GAP_BONDING)
                    {
                        cy_ble_pendingFlashWrite |= CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT;
                    }
                #endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */
                }

                /* Clear callback flag indicating that request was handled */
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            }
        }
    }

    return(gattErr);
}


