ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_hps.c
/******************************************************************************
* Function Name: Cy_BLE_HPSS_PrepareWriteRequestEventHandler
***************************************************************************//**
*
*  Handles the Write Request HTTP Proxy Service.
*
*  \param eventParam: The pointer to the data that received with a prepare write
*                     request event for the HTTP Proxy Service.
*
******************************************************************************/
static void Cy_BLE_HPSS_PrepareWriteRequestEventHandler(const cy_stc_ble_gatts_prep_write_req_param_t *eventParam)
{
    if(Cy_BLE_HPS_ApplCallback != NULL)
    {
        if((eventParam->baseAddr[eventParam->currentPrepWriteReqCount - 1u].handleValuePair.attrHandle ==
            cy_ble_hpsConfigPtr->hpss->charInfo[CY_BLE_HPS_URI].charHandle) ||
           (eventParam->baseAddr[eventParam->currentPrepWriteReqCount - 1u].handleValuePair.attrHandle ==
            cy_ble_hpsConfigPtr->hpss->charInfo[CY_BLE_HPS_HTTP_HEADERS].charHandle) ||
           (eventParam->baseAddr[eventParam->currentPrepWriteReqCount - 1u].handleValuePair.attrHandle ==
            cy_ble_hpsConfigPtr->hpss->charInfo[CY_BLE_HPS_HTTP_ENTITY_BODY].charHandle))
        {
            if(cy_ble_hpssReqHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
            {
                /* Send Prepare Write Response which identifies acknowledgment for
                 * long characteristic value write.
                 */

                cy_ble_hpssReqHandle =
                    eventParam->baseAddr[eventParam->currentPrepWriteReqCount - 1u].handleValuePair.attrHandle;
            }
            /* Indicate that request was handled */
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_HPSS_ExecuteWriteRequestEventHandler
***************************************************************************//**
*
*  Handles the Execute Write Request Event for the HTTP Proxy Service.
*
*  \param eventParam: The pointer to the data that came with a write request
*                     for the HTTP Proxy Service.
*
******************************************************************************/
static void Cy_BLE_HPSS_ExecuteWriteRequestEventHandler(cy_stc_ble_gatts_exec_write_req_t *eventParam)
{
    uint32_t locCount;
    uint16_t locLength = 0u;
    cy_stc_ble_gatt_value_t locCharValue;
    cy_stc_ble_hps_char_value_t wrCharReqParam = { .connHandle = eventParam->connHandle };

    if((Cy_BLE_HPS_ApplCallback != NULL) && (cy_ble_hpssReqHandle != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        if((eventParam->baseAddr[0u].handleValuePair.attrHandle ==
            cy_ble_hpsConfigPtr->hpss->charInfo[CY_BLE_HPS_URI].charHandle) ||
           (eventParam->baseAddr[0u].handleValuePair.attrHandle ==
            cy_ble_hpsConfigPtr->hpss->charInfo[CY_BLE_HPS_HTTP_HEADERS].charHandle) ||
           (eventParam->baseAddr[0u].handleValuePair.attrHandle ==
            cy_ble_hpsConfigPtr->hpss->charInfo[CY_BLE_HPS_HTTP_ENTITY_BODY].charHandle))
        {
            /* Check the execWriteFlag before execute or cancel write long operation */
            if(eventParam->execWriteFlag == CY_BLE_GATT_EXECUTE_WRITE_EXEC_FLAG)
            {
                /* Calculate total length */
                for(locCount = 0u; locCount < eventParam->prepWriteReqCount; locCount++)
                {
                    locLength += eventParam->baseAddr[locCount].handleValuePair.value.len;
                }

                if(CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_MAX_LEN(cy_ble_hpssReqHandle) >= locLength)
                {
                    /* Fill data and pass it to user */
                    if(eventParam->baseAddr[0u].handleValuePair.attrHandle == cy_ble_hpsConfigPtr->hpss->
                        charInfo[CY_BLE_HPS_URI].charHandle)
                    {
                        wrCharReqParam.charIndex = CY_BLE_HPS_URI;
                    }
                    else if(eventParam->baseAddr[0u].handleValuePair.attrHandle ==
                            cy_ble_hpsConfigPtr->hpss->charInfo[CY_BLE_HPS_HTTP_HEADERS].charHandle)
                    {
                        wrCharReqParam.charIndex = CY_BLE_HPS_HTTP_HEADERS;
                    }
                    else
                    {
                        wrCharReqParam.charIndex = CY_BLE_HPS_HTTP_ENTITY_BODY;
                    }


                    wrCharReqParam.gattErrorCode = CY_BLE_GATT_ERR_NONE;
                    locCharValue = eventParam->baseAddr[0u].handleValuePair.value;
                    wrCharReqParam.value = &locCharValue;
                    wrCharReqParam.value->len = locLength;

                    Cy_BLE_HPS_ApplCallback((uint32_t)CY_BLE_EVT_HPSS_WRITE_CHAR, &wrCharReqParam);

                    if(wrCharReqParam.gattErrorCode == CY_BLE_GATT_ERR_NONE)
                    {
                        CY_BLE_GATT_DB_ATTR_SET_ATTR_GEN_LEN(cy_ble_hpssReqHandle, locLength);
                    }
                }
                else
                {
                    wrCharReqParam.gattErrorCode = CY_BLE_GATT_ERR_INVALID_ATTRIBUTE_LEN;
                }

                /* Pass user error code to Stack */
                eventParam->gattErrorCode = (uint8_t)wrCharReqParam.gattErrorCode;
            }

            /* Indicate that request was handled */
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;

            /* Clear requested handle */
            cy_ble_hpssReqHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_HPSS_SetCharacteristicValue
***************************************************************************//**
*
*  Sets a value for one of characteristic values of the HTTP Proxy
*  Service. The characteristic is identified by charIndex.
*
*  \param charIndex: The index of a HTTP Proxy Service characteristic.
*  \param attrSize:  The size of the characteristic value attribute.
*  \param attrValue: The pointer to the characteristic value data that should be
*                    stored to the GATT database.
*
* \return
*  A return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The characteristic value was written successfully.
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_HPSS_SetCharacteristicValue(cy_en_ble_hps_char_index_t charIndex,
                                                          uint16_t attrSize,
                                                          uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;

    if((attrValue != NULL) && (charIndex < CY_BLE_HPS_CHAR_COUNT))
    {
        /* Fill structure */
        cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
        {
            .handleValuePair.attrHandle = cy_ble_hpsConfigPtr->hpss->charInfo[charIndex].charHandle,
            .handleValuePair.value.len  = attrSize,
            .handleValuePair.value.val  = attrValue,
            .offset                     = 0u,
            .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
        };

