ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_hps.c
            cy_ble_hpscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            Cy_BLE_HPS_ApplCallback((uint32_t)CY_BLE_EVT_HPSC_READ_CHAR_RESPONSE, &locCharValue);
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else if(cy_ble_hpscReqHandle[discIdx] == cy_ble_hpsc[discIdx].charInfo[CY_BLE_HPS_HTTP_STATUS_CODE].
                 descrHandle[CY_BLE_HPS_CCCD])
        {
            cy_stc_ble_hps_descr_value_t locDescrValue =
            {
                .connHandle = eventParam->connHandle,
                .charIndex  = CY_BLE_HPS_HTTP_STATUS_CODE,
                .descrIndex = CY_BLE_HPS_CCCD,
                .value      = &eventParam->value
            };

            cy_ble_hpscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            Cy_BLE_HPS_ApplCallback((uint32_t)CY_BLE_EVT_HPSC_READ_DESCR_RESPONSE, &locDescrValue);
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else
        {
            /* Do nothing */
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_HPSC_ReadLongRespEventHandler
***************************************************************************//**
*
*  Handles a Read Long Response event for the HTTP Proxy Service.
*
*  \param eventParam: The pointer to the data structure specified by an event.
*
******************************************************************************/
static void Cy_BLE_HPSC_ReadLongRespEventHandler(const cy_stc_ble_gattc_read_rsp_param_t *eventParam)
{
    cy_stc_ble_gattc_stop_cmd_param_t stopCmdParam = { .connHandle = eventParam->connHandle };
    cy_stc_ble_gatt_xchg_mtu_param_t mtuParam = { .connHandle = eventParam->connHandle };
    cy_en_ble_hps_char_index_t locCharIndex;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);
    uint32_t isReqEnded = 1u;

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_HPS_ApplCallback != NULL))
    {
        /* Check if requested handle equals to any of HPS characteristic handles */
        if(cy_ble_hpscReqHandle[discIdx] == cy_ble_hpsc[discIdx].charInfo[CY_BLE_HPS_URI].valueHandle)
        {
            locCharIndex = CY_BLE_HPS_URI;
        }
        else if(cy_ble_hpscReqHandle[discIdx] == cy_ble_hpsc[discIdx].charInfo[CY_BLE_HPS_HTTP_HEADERS].valueHandle)
        {
            locCharIndex = CY_BLE_HPS_HTTP_HEADERS;
        }
        else if(cy_ble_hpscReqHandle[discIdx] == cy_ble_hpsc[discIdx].charInfo[CY_BLE_HPS_HTTP_ENTITY_BODY].valueHandle)
        {
            locCharIndex = CY_BLE_HPS_HTTP_ENTITY_BODY;
        }
        else
        {
            locCharIndex = CY_BLE_HPS_CHAR_COUNT;
        }

        /* If match was found then proceed with the request handling */
        if((locCharIndex < CY_BLE_HPS_CHAR_COUNT) && (cy_ble_hpscReqHandle[discIdx] !=
                                                      CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
        {
            /* Update user buffer with received data */
            if(cy_ble_hpscCurrLen < cy_ble_hpscRdLongBuffLen)
            {
                (void)memcpy((void*)&cy_ble_hpscRdLongBuffPtr[cy_ble_hpscCurrLen], (void*)&eventParam->value.val[0],
                             (uint32_t)eventParam->value.len);

                cy_ble_hpscCurrLen += eventParam->value.len;
            }

            (void)Cy_BLE_GATT_GetMtuSize(&mtuParam);

            /* If the received data length is less than the MTU size, the Read Long
             * request is completed or the provided user's buffer is full.
             */
            if(((mtuParam.mtu - 1u) > eventParam->value.len))
            {
                cy_ble_hpscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            }
            else if(cy_ble_hpscCurrLen == cy_ble_hpscRdLongBuffLen)
            {
                (void)Cy_BLE_GATTC_StopCmd(&stopCmdParam);
            }
            else
            {
                isReqEnded = 0u;
            }

            /* If the buffer is full, then stop processing any remaining read long
             * requests.
             */
            if(isReqEnded == 1u)
            {
                cy_stc_ble_hps_char_value_t rdCharValue = { .connHandle = eventParam->connHandle };

                cy_stc_ble_gatt_value_t rdValue =
                {
                    .val = cy_ble_hpscRdLongBuffPtr,
                    .len = cy_ble_hpscCurrLen
                };
                rdCharValue.charIndex = locCharIndex;
                rdCharValue.value = &rdValue;

                Cy_BLE_HPS_ApplCallback((uint32_t)CY_BLE_EVT_HPSC_READ_CHAR_RESPONSE, &rdCharValue);
                cy_ble_hpscCurrLen = 0u;
            }

            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_HPSC_WriteResponseEventHandler
***************************************************************************//**
*
*  Handles a Write Response event for the HTTP Proxy Service.
*
*  \param eventParam: The pointer to a data structure specified by an event.
*
******************************************************************************/
static void Cy_BLE_HPSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    cy_en_ble_hps_char_index_t locCharIndex;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(*eventParam);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_HPS_ApplCallback != NULL) &&
       (cy_ble_hpscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        for(locCharIndex = CY_BLE_HPS_URI; (locCharIndex < CY_BLE_HPS_CHAR_COUNT); locCharIndex++)
        {
            if(cy_ble_hpscReqHandle[discIdx] == cy_ble_hpsc[discIdx].charInfo[locCharIndex].valueHandle)
            {
                break;
            }
        }

        if(locCharIndex < CY_BLE_HPS_CHAR_COUNT)
        {
            cy_stc_ble_hps_char_value_t locCharValue =
            {
                .connHandle = *eventParam,
                .charIndex  = locCharIndex,
                .value      = NULL
            };

